robert-hh/micropython/ports/mimxrt/machine_sdcard.c
    status = sdcard_set_active(self->sdcard);
    if (!status) {
        return false;
    }

    status = sdcard_cmd_go_idle_state(self->sdcard);
    if (!status) {
        return false;
    }

    uint32_t oper_cond;  // Todo: evaluate operation conditions
    status = sdcard_cmd_oper_cond(self->sdcard, &oper_cond);
    if (!status) {
        return false;
    }

    status = sdcard_volt_validation(self->sdcard);
    if (!status) {
        return false;
    }

    // ===
    // Ready State
    // ===
    cid_t cid_all;
    status = sdcard_cmd_all_send_cid(self->sdcard, &cid_all);
    if (!status) {
        return false;
    }

    // ===
    // Identification State
    // ===
    status = sdcard_cmd_set_rel_add(self->sdcard, &self->rca);
    if (!status) {
        return false;
    }

    // ===
    // Standby State
    // ===
    (void)USDHC_SetSdClock(self->sdcard, CLOCK_GetSysPfdFreq(kCLOCK_Pfd2) / 3, 20000000UL);

    csd_t csd;
    status = sdcard_cmd_send_csd(self->sdcard, self->rca, &csd);
    if (!status) {
        return false;
    }
    sdcard_decode_csd(self, &csd);

    cid_t cid;
    status = sdcard_cmd_send_cid(self->sdcard, self->rca, &cid);
    if (!status) {
        return false;
    }

    // ===
    // Transfer State
    // ===
    status = sdcard_cmd_select_card(self->sdcard, self->rca);
    if (!status) {
        return false;
    } else {
        self->initialized = true;
        return true;
    }
}

static bool sdcard_power_off(mimxrt_sdcard_obj_t *self) {
    return true;
}


STATIC int machine_sdcard_init_helper(mimxrt_sdcard_obj_t *self, const mp_arg_val_t *args) {
    if (self->initialized) {
        return 1;
    }

    // Initialize pins

    // TODO: Implement APi for pin.c to initialize a GPIO for an ALT function


    // GPIO_SD_B0_03 | ALT0 | USDHC1_CLK   | SD1_CLK   | CLK
    IOMUXC_SetPinMux(self->pins.clk.pin->muxRegister, self->pins.clk.af_idx, 0U, 0U, self->pins.clk.pin->configRegister, 0U);
    IOMUXC_SetPinConfig(self->pins.clk.pin->muxRegister, self->pins.clk.af_idx, 0U, 0U, self->pins.clk.pin->configRegister, 0x10B0u);

    // GPIO_SD_B0_02 | ALT0 | USDHC1_CMD   | SD1_CMD   | CMD
    IOMUXC_SetPinMux(self->pins.cmd.pin->muxRegister, self->pins.cmd.af_idx, 0U, 0U, self->pins.cmd.pin->configRegister, 0U);
    IOMUXC_SetPinConfig(self->pins.cmd.pin->muxRegister, self->pins.cmd.af_idx, 0U, 0U, self->pins.cmd.pin->configRegister, 0x10B0u);

    // GPIO_SD_B0_06 | ALT0 | USDHC1_CD_B  | SD_CD_SW  | DETECT
    IOMUXC_SetPinMux(self->pins.cd_b.pin->muxRegister, self->pins.cd_b.af_idx, 0U, 0U, self->pins.cd_b.pin->configRegister, 0U);
    IOMUXC_SetPinConfig(self->pins.cd_b.pin->muxRegister, self->pins.cd_b.af_idx, 0U, 0U, self->pins.cd_b.pin->configRegister, 0x10B0u);


    // GPIO_SD_B0_04 | ALT0 | USDHC1_DATA0 | SD1_D0    | DAT0
    IOMUXC_SetPinMux(self->pins.data0.pin->muxRegister, self->pins.data0.af_idx, 0U, 0U, self->pins.data0.pin->configRegister, 0U);
    IOMUXC_SetPinConfig(self->pins.data0.pin->muxRegister, self->pins.data0.af_idx, 0U, 0U, self->pins.data0.pin->configRegister, 0x10B0u);

    // GPIO_SD_B0_05 | ALT0 | USDHC1_DATA1 | SD1_D1    | DAT1
    IOMUXC_SetPinMux(self->pins.data1.pin->muxRegister, self->pins.data1.af_idx, 0U, 0U, self->pins.data1.pin->configRegister, 0U);
    IOMUXC_SetPinConfig(self->pins.data1.pin->muxRegister, self->pins.data1.af_idx, 0U, 0U, self->pins.data1.pin->configRegister, 0x10B0u);


    // GPIO_SD_B0_00 | ALT0 | USDHC1_DATA2 | SD1_D2    | DAT2
    IOMUXC_SetPinMux(self->pins.data2.pin->muxRegister, self->pins.data2.af_idx, 0U, 0U, self->pins.data2.pin->configRegister, 0U);
    IOMUXC_SetPinConfig(self->pins.data2.pin->muxRegister, self->pins.data2.af_idx, 0U, 0U, self->pins.data2.pin->configRegister, 0x10B0u);

    // GPIO_SD_B0_01 | ALT0 | USDHC1_DATA3 | SD1_D3    | CD/DAT3
    IOMUXC_SetPinMux(self->pins.data3.pin->muxRegister, self->pins.data3.af_idx, 0U, 0U, self->pins.data3.pin->configRegister, 0U);
    IOMUXC_SetPinConfig(self->pins.data3.pin->muxRegister, self->pins.data3.af_idx, 0U, 0U, self->pins.data3.pin->configRegister, 0x10B0u);

    // Initialize USDHC
    const usdhc_config_t config = {
        .endianMode = kUSDHC_EndianModeLittle,
        .dataTimeout = 0xFU,
        .readWatermarkLevel = 16U,  // Todo: Configure meaningfull watermark level
        .writeWatermarkLevel = 16U,  // Todo: Configure meaningfull watermark level
    };

    USDHC_Init(self->sdcard, &config);
    if (USDHC_DetectCardInsert(self->sdcard)) {
        (void)USDHC_SetSdClock(self->sdcard, CLOCK_GetSysPfdFreq(kCLOCK_Pfd2) / 3, 300000UL);
        USDHC_SetDataBusWidth(self->sdcard, kUSDHC_DataBusWidth1Bit);
        self->inserted = true;
        return 1;
    } else {
        return -1;
    }
}

STATIC mp_obj_t sdcard_obj_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {
    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, all_args + n_args);

    // Parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, all_args, &kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // Extract arguments
    mp_int_t sdcard_id = args[SDCARD_INIT_ARG_ID].u_int;

    if (!(1 <= sdcard_id && sdcard_id <= (sizeof(mimxrt_sdcard_objs) / sizeof(mimxrt_sdcard_obj_t)))) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError, "SDCard(%d) doesn't exist", sdcard_id));
    }

    mimxrt_sdcard_obj_t *self = &mimxrt_sdcard_objs[(sdcard_id - 1)];

    // Initialize SDCard Host
    if (machine_sdcard_init_helper(self, args)) {
        return MP_OBJ_FROM_PTR(self);
    } else {
        return MP_OBJ_NULL;
    }
}

// init()
STATIC mp_obj_t machine_sdcard_init(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    // Parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args) - 1];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // Todo: make sure that there is a valid reason that a call to init would not change anything for an already initialized hsot
    machine_sdcard_init_helper(pos_args[0], args);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_sdcard_init_obj, 1, machine_sdcard_init);

// deinit()
STATIC mp_obj_t machine_sdcard_deinit(mp_obj_t self_in) {
    // TODO: Implement deinit function
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_sdcard_deinit_obj, machine_sdcard_deinit);

// readblocks(block_num, buf, [offset])
STATIC mp_obj_t machine_sdcard_readblocks(mp_obj_t self_in, mp_obj_t _block_num, mp_obj_t _buf) {
    mp_buffer_info_t bufinfo;
    mimxrt_sdcard_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_get_buffer_raise(_buf, &bufinfo, MP_BUFFER_WRITE);
    // ---
    if (sdcard_cmd_set_blocklen(self->sdcard, SDMMC_DEFAULT_BLOCK_SIZE)) {
        if (sdcard_read(self, bufinfo.buf, mp_obj_get_int(_block_num), bufinfo.len / SDMMC_DEFAULT_BLOCK_SIZE)) {
            return MP_OBJ_NEW_SMALL_INT(0);
        } else {
            return MP_OBJ_NEW_SMALL_INT(-1);  // readblocks failed
        }
    } else {
        return MP_OBJ_NEW_SMALL_INT(-1);  // readblocks failed
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(machine_sdcard_readblocks_obj, machine_sdcard_readblocks);

// writeblocks(block_num, buf, [offset])
STATIC mp_obj_t machine_sdcard_writeblocks(mp_obj_t self_in, mp_obj_t _block_num, mp_obj_t _buf) {
    mp_buffer_info_t bufinfo;
    mimxrt_sdcard_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_get_buffer_raise(_buf, &bufinfo, MP_BUFFER_WRITE);
    // ---
    if (sdcard_cmd_set_blocklen(self->sdcard, SDMMC_DEFAULT_BLOCK_SIZE)) {
        if (sdcard_write(self, bufinfo.buf, mp_obj_get_int(_block_num), bufinfo.len / SDMMC_DEFAULT_BLOCK_SIZE)) {
            return MP_OBJ_NEW_SMALL_INT(0);
        } else {
            return MP_OBJ_NEW_SMALL_INT(-1);  // writeblocks failed
        }
    } else {
        return MP_OBJ_NEW_SMALL_INT(-1);  // writeblocks failed
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(machine_sdcard_writeblocks_obj, machine_sdcard_writeblocks);

